[PAD]
21224
8197
15274
7664
7706
4246
19311
14123
12772
12617
1027
3948
16512
21097
10925
11123
19421
4846
4216
159
3166
6102
2699
9391
10789
7384
18826
16046
5163
17219
17145
16496
17597
13751
15822
2128
2289
20027
16712
17186
2819
18538
19006
5025
11255
2034
20451
9779
4859
20583
14126
20359
17681
3452
17166
12062
15345
14937
4104
14077
13513
6754
10609
3445
2379
10341
13670
13552
14091
16201
20170
20743
19215
1856
14477
6967
17565
20620
3253
8649
14459
3009
13494
17325
16980
15020
16806
567
4106
1961
13781
20958
2969
3277
20859
954
19365
18158
2649
19184
11664
12943
13519
1886
11642
14747
4921
882
6006
6196
19285
14812
4718
6303
13553
9088
17225
16805
1668
3988
9906
3545
4779
11188
6254
6642
6112
5863
1847
17592
13862
10092
17083
1819
16374
15426
7938
7747
16688
4688
18199
8387
7106
7649
15788
9007
8487
10223
19936
586
533
6000
3647
15556
20813
18571
14360
12302
10037
14499
13614
16419
16929
968
7047
14244
15060
13309
13426
16113
2240
8217
6051
19675
16654
2658
11033
15785
7379
3380
19934
9954
2003
2250
12172
14478
6437
17808
9732
16435
12851
5379
15140
10072
15034
9199
5808
17337
19258
19425
7501
7251
20815
4387
9887
8379
3424
11806
7105
14978
20279
6991
19832
17427
20600
13487
6478
19638
8064
19453
15582
19851
12610
14199
8373
11122
1965
5759
8617
17964
17348
12751
6625
13940
46
14253
5190
3133
400
10158
17304
18736
4929
20573
17667
4935
17370
16362
1173
3191
2483
16546
5391
9005
10627
11581
10512
5870
11167
8505
695
7438
14132
20808
7230
1223
16979
10571
3061
3083
17622
11972
2557
19302
3028
17759
18705
11685
12607
18802
2680
927
17047
4703
10841
18799
19616
10455
4223
6891
6312
6299
2797
19061
15718
14498
9701
5026
9433
15492
11103
15762
7990
2643
297
8489
4758
3738
4954
4190
10690
13248
14640
8344
19877
5985
6522
18053
19120
4808
23
4948
10920
875
511
13529
5626
10399
19864
16816
11068
19356
2702
18288
9211
16327
10870
19853
13046
15692
8572
3999
2771
9187
11924
20544
10777
3809
1353
10332
10536
1488
5908
5810
15212
11743
1519
14675
974
9460
4886
2161
8885
14346
13664
17457
5930
14033
2896
18496
18620
497
4243
9679
11331
14358
12266
8038
4077
6484
17624
6306
14277
17600
11735
13821
15964
17359
5390
8952
17732
9267
11746
4616
6384
11543
20201
204
13159
16885
16498
2041
18173
13129
15287
1984
3047
13170
4244
14582
15372
16623
13317
17516
6181
17789
10516
21145
6858
12333
6255
19529
709
9942
18094
659
6733
861
1866
12911
7040
2764
537
8041
15462
21125
14722
9442
12540
962
15712
13040
286
10903
4513
15033
17126
6258
4840
4988
8467
7380
18952
2869
12721
7420
6471
5368
20129
9350
13146
10938
20148
18282
6600
4581
5736
19127
14790
4750
19534
19907
4570
7020
11384
6623
15041
10270
19172
18038
14867
1514
14803
6353
58
11996
13696
971
20048
18016
18660
18781
19315
5966
2849
2438
5635
19543
14658
3441
14564
17031
17532
5616
8715
14286
17159
2641
17735
14422
15655
13924
16077
1457
9860
16093
7069
2256
8808
13968
8428
6164
21131
162
6201
11249
18102
15799
6068
4204
19828
12252
3248
17506
6682
14169
17409
11553
9233
9180
10869
12469
20611
4250
15574
9254
11990
21115
10619
2432
9312
9186
13004
11043
1801
7917
3510
9629
17831
7199
4275
2242
20684
5557
13711
16369
17773
7942
1250
5815
3421
19752
5797
18057
6329
9499
11378
13550
18732
9089
160
3768
9933
708
1939
18059
5332
12164
18850
20790
6594
16288
768
14796
8141
11530
10247
5018
19429
8354
12093
4864
7659
9452
7769
9481
5156
6042
6135
14313
4350
15324
10763
17281
19952
8112
21195
6574
632
12788
12299
4211
6463
689
10083
17000
17939
18103
19987
14903
15428
19234
19200
3323
11329
20588
19247
19536
4034
19181
15838
17851
14839
6040
8077
3486
1032
20667
2709
6523
4967
11385
132
17909
1911
8523
3625
18097
3267
11367
19134
11499
5067
14523
19415
7432
7523
15920
17712
9473
10075
10520
20440
14784
18056
6174
19807
14815
10729
9001
16217
15950
7007
20168
1784
19229
4273
8551
19977
9220
19224
3967
3935
4191
18100
17136
15913
16722
5008
6997
5157
8110
14949
10427
20365
19092
17834
17682
18341
634
2485
8691
20470
416
15259
3976
7096
7232
12985
10229
4089
16254
5852
16687
16108
8179
304
11605
2273
20224
3862
6839
2457
18958
10965
9576
19618
7994
10432
18659
7700
13544
4526
21178
700
7629
2830
16222
15671
6225
20449
19813
8806
11099
7820
20284
2984
18928
19735
12643
8868
1827
15915
20138
17488
7529
3786
11431
18430
15699
5724
17885
717
1166
1215
1269
6601
9479
635
1581
9405
2729
11310
9675
9401
4183
19074
2203
12664
10545
10803
19592
19808
5848
11133
10063
3868
14723
16873
9921
18641
10765
8325
11622
9079
12992
9361
2696
10141
16110
20372
16718
959
16789
8317
19204
16948
6086
16195
17705
15673
16906
19776
18535
1769
13789
4487
14642
13280
13843
21215
14854
10524
4167
1625
18393
3249
2974
1884
3157
1749
6005
4163
10352
7593
9685
14350
9298
4114
983
3134
13593
16105
3888
20411
17475
16357
8814
20827
16872
6706
15874
20691
14039
7995
4615
984
15193
12488
2568
2422
14481
3007
12307
3343
20312
20247
16993
20035
13014
13623
5457
17104
8584
15898
11934
3970
15294
12666
6092
1033
11487
4528
9910
7731
12082
14320
7518
18318
9409
6850
9221
6930
13092
10000
18988
16550
20310
5717
20869
14085
11505
20725
1043
2513
2276
17019
10013
8640
336
2361
12884
15025
13480
7411
241
1059
21141
19716
16138
2051
6130
13135
7647
18699
10800
13002
18971
7605
19665
8907
14684
6036
10850
14908
16730
964
957
14002
15709
11250
9655
18771
12850
18372
19214
3981
16449
8746
4530
15612
581
2492
18403
18128
897
16679
13514
7859
4598
3454
4091
9249
3468
5540
19570
16957
18347
5647
19370
17797
19823
18101
12193
14461
8738
14714
10962
10134
18962
3872
11541
14196
13851
2473
1969
3431
15669
12256
15465
7111
21023
10951
16468
16879
13534
670
890
1966
3722
11689
13221
3682
17765
14464
8033
10671
7684
18113
6093
11702
3669
20821
9068
12474
10226
6422
19316
11679
12052
18593
16908
9730
21163
20733
4218
1595
13964
3642
18241
6710
20732
16149
12659
15468
4509
20849
9234
18474
19024
5918
6229
19479
16820
538
13767
18830
15594
11652
8358
6816
3310
17606
16199
1432
1274
31
12083
12228
17441
10890
1898
17998
18968
9070
5711
18541
17430
787
3662
14971
8891
8743
9435
18222
12502
6443
10272
1278
11727
1910
5564
2801
15978
15596
15580
2604
9901
16866
12518
5323
2052
10293
4893
16341
2687
16061
11927
10575
4150
10985
14309
12080
15682
1146
18330
6018
7755
11276
14428
21052
2668
10053
19976
8333
8122
10249
2008
19916
2135
11557
19222
6060
6088
4140
5227
10754
9661
12541
11198
7255
19741
9741
17228
7377
5718
12324
2402
364
19517
357
15833
1511
21035
9056
8792
7272
8014
4939
2997
19890
2076
2881
3621
942
18227
11309
1727
21209
9279
11612
16075
21155
3596
20298
10720
11185
6662
1702
18521
11196
1260
607
356
9683
9717
8772
12797
21082
5330
7236
11634
10940
542
18485
1308
10699
14673
13010
19552
8637
3591
7672
20707
4229
15629
1530
10706
17363
18941
5779
5470
15111
378
3219
6736
1046
14930
4517
21046
4545
16073
14383
8601
18551
6540
1016
11300
14146
11352
7941
11656
2573
4767
13333
3568
10807
9327
1054
17220
17813
15227
9600
2083
10355
3500
10537
16784
5857
12550
8154
17956
2822
9196
3122
13582
685
16710
15260
20172
6610
4432
13680
10589
18894
8789
19090
4481
75
234
5537
20380
20393
4875
15567
11659
8337
9443
17296
8456
13966
4903
10204
17691
19041
5844
3268
11865
9697
4493
11221
10259
4271
1639
5884
6916
15293
20901
2525
15349
1598
13266
15758
21025
6003
11298
15828
20426
12470
17863
18054
8794
6765
21117
4088
5861
5767
17389
10886
7802
4200
11277
11061
20353
19174
6057
2625
16534
9253
12076
1942
12294
10240
4720
10532
13549
6919
3043
11407
10450
200
11882
7427
11230
16653
15836
14205
6519
4797
19629
13449
1815
7104
5188
10865
9178
3295
18487
4685
1368
10997
17634
15163
18577
10100
8913
11476
3873
14119
5172
18574
19759
2508
17320
9772
6013
9422
10686
14270
18425
10393
13667
20124
6156
17850
14303
6677
5687
9418
16535
14063
17114
3341
14862
8316
5475
11334
12057
5885
16312
453
19654
20507
5013
9463
9865
8893
15074
19457
17899
13753
14840
12253
7571
417
17473
13565
12241
19786
16773
16655
16086
13503
16032
15210
6724
11945
9067
2664
12026
8734
19792
7982
6803
10635
15875
18782
12622
9770
11860
7805
12936
16010
1660
3024
3069
16262
19520
21152
15004
3893
10957
8883
15352
7448
20717
14868
13085
15100
12757
1716
4166
11755
11773
12141
2087
16709
17820
10815
19354
17996
3652
16585
7212
20795
11922
17040
6148
14632
1719
1893
7118
18448
3778
3620
5424
18212
10339
20464
19766
16150
17514
14977
5850
18780
13358
18250
20354
17154
19955
14059
440
9552
8608
4938
1309
19972
17559
734
8289
8732
3940
19794
12257
5312
1354
10511
17456
192
4830
9718
7344
2396
7270
4149
7012
13706
9167
18004
14537
15997
9674
68
3660
15899
17405
8194
16456
15138
152
18005
8397
16643
20955
6507
772
3576
18126
20518
19707
12508
10376
755
3871
19375
2812
17005
9590
18202
20238
7139
9596
18205
9810
11784
13034
13758
715
20350
16367
16228
14250
8231
16951
13573
21168
4169
5665
7726
20268
14530
16876
14738
123
4682
16243
17204
10504
19443
16109
4925
5871
11470
18740
2948
7217
18811
270
6608
13669
12983
21086
13634
3889
6023
3027
20400
8554
19626
7248
16225
11645
15744
3533
19206
980
7244
15493
11421
5076
4096
14576
16470
18652
17274
19705
19286
15198
1571
13278
8081
10868
16574
5949
1366
19962
16853
6186
17453
6235
7545
19133
17305
1169
10922
9396
20730
8331
11910
15491
9322
20627
20755
13139
15449
19474
13087
10847
7356
19896
18996
16328
17392
20884
13918
18333
19465
8884
4060
18677
7735
16068
4264
6756
289
18837
12505
17807
16614
832
4119
10562
12561
3641
16541
9825
18597
10463
839
19220
4294
14843
5185
19209
8624
20158
10051
18764
6393
6835
13938
11498
10531
585
5155
10689
880
15994
18194
9657
12755
2578
691
18389
2772
17023
13262
18570
7081
1202
8949
9688
1424
19291
7707
18443
19113
16284
1751
19852
6741
7495
16127
4125
9799
18872
1944
7035
16294
3875
18829
7679
5477
13817
11555
7762
16509
9968
18693
10078
9307
9763
12394
8771
5092
7665
13324
16769
8415
9987
12305
9269
10696
13300
18080
2297
16889
10121
2863
16305
13425
20537
15495
17878
2104
5276
20478
14397
18932
19734
19431
15782
13717
9998
8993
11340
5940
15862
12844
2543
6033
17253
13470
2238
5365
3105
17629
13396
781
14778
19643
13682
15595
5269
8529
4815
7009
13931
2569
19961
6072
13906
15362
130
13406
938
1567
3199
17271
20119
17388
20192
14621
19337
4112
18695
1188
8147
12111
6365
20503
422
16622
4288
3906
5523
15851
15116
2632
14913
1705
12766
9344
7640
2066
13395
9027
5175
17591
4659
20982
8926
2996
6666
2924
17444
21042
13116
13173
16720
18498
3752
16074
13742
20923
21208
16664
4725
5296
7142
10563
14864
17602
9343
15944
13994
10387
9308
21120
9022
11415
6911
20972
7391
2715
16864
8370
11919
7549
4757
5112
18475
19237
6134
18572
6653
11253
20137
15182
6286
8347
10975
7080
8950
19138
13193
18391
3785
21182
3895
12520
16839
13124
5688
1869
327
14236
19
4555
3251
8324
18045
20692
16407
1531
277
9423
6417
16394
7053
20909
2503
7897
5480
20347
11350
1539
3182
4032
15105
20970
7552
13298
7268
10447
15951
15900
5028
11774
354
6772
5342
11770
2640
7912
20522
4613
814
12360
2686
7
4932
11646
257
13321
10866
14403
13989
10179
9286
6291
6491
9876
9909
20067
20401
7573
933
10894
20024
18127
3073
13546
7677
17252
19803
8533
14770
12157
18882
5639
10645
20992
16163
4931
2108
20235
18437
19282
18658
18262
14051
4873
11489
2036
11586
4057
595
9215
17775
15042
17638
17064
2086
15097
2089
18973
629
6596
3137
19283
5348
15666
1611
3861
15681
14488
15893
8853
19180
3110
16275
6635
13460
15897
13957
10325
2912
13218
462
16849
17949
18131
3119
13728
17070
9577
5003
16166
20759
15541
1708
1426
17057
13916
19560
944
14501
5745
1885
4473
10467
2095
14848
1097
14271
4648
19863
4531
10872
16285
14985
9171
12566
15166
20456
15172
5953
10845
9780
2411
16800
6456
13597
10459
6603
4376
20333
3937
2213
13152
19732
2554
8363
20833
19066
774
7388
1852
17408
11
5201
7133
14519
15340
11964
19527
13956
9488
17870
11787
14834
17168
10337
4122
1330
13194
7979
1474
17090
8881
18319
9689
10936
5444
5510
20441
20513
17178
3167
6649
6109
21172
8819
4819
13803
14094
20519
20572
10461
12162
14752
2738
10673
19632
20226
10557
8575
12184
16694
2219
11944
4563
16961
5599
16377
5543
16955
5743
19026
9698
3383
10374
7666
13420
20351
13198
3991
18562
17992
6142
10012
11292
14222
9119
1642
19607
4772
3910
8707
10565
477
3740
143
9861
7508
20830
10839
11946
17523
16263
15283
21106
17068
10126
9525
19019
11183
17198
6212
12049
2253
18301
20907
20580
12596
16308
17632
12369
3296
3302
20549
1841
5440
8936
11080
807
14545
20206
17685
15511
14764
16
17756
11439
14246
4752
3963
11556
14698
3859
5517
1636
4557
5818
12750
11531
2535
5917
15402
4923
7214
2171
12454
16057
7786
10943
10318
18986
16682
11684
1208
15878
16214
18954
20688
2836
7563
12839
12682
6081
10019
2321
1725
12036
9948
2413
5374
5592
17510
16015
20931
18924
6829
20200
19994
4664
2978
11303
17783
21009
19696
6634
4972
7070
1881
12448
14691
10243
6116
8208
2656
11211
19910
4382
17237
3288
15174
16335
9581
14589
14285
19964
12903
14744
4764
10707
7313
19481
19624
17190
8148
14873
7253
14745
12378
13925
15516
11391
4804
4022
15305
11874
6376
19189
16745
20935
16331
2445
5264
8083
17572
1687
9498
5359
9624
13016
13451
8536
9354
20059
18675
17731
2450
10197
17194
7190
12287
3748
8618
7326
10600
7974
19554
4095
6752
9275
5782
2824
10492
17010
11825
18332
12734
12727
13907
19599
4860
9635
12175
1020
1569
9504
8730
20932
16648
8726
15269
9389
14592
11824
14294
13947
14773
17798
11101
2078
18772
15313
2403
8120
14912
6595
0
6205
10933
16795
8423
4081
15036
19604
404
9882
12521
19749
838
8219
3213
4121
2663
19423
10559
20983
11842
16692
1584
452
20965
9182
15110
17955
19112
19773
19023
3391
311
17391
1840
16568
15153
4853
3456
10190
7307
13416
17407
9444
13596
16703
12455
10149
11588
9427
19139
15220
13610
15469
1517
1587
17215
20953
17684
17972
13979
9485
11332
19841
20097
8900
12592
11895
11341
3274
19013
2012
4015
15956
17744
14149
19548
1958
8856
4866
3840
16481
7579
6824
8005
3538
3178
2200
19532
19310
3286
16151
6128
7318
15537
16949
146
9170
8116
7152
10362
11000
5636
5082
1479
13154
2212
2821
6778
10163
8458
9595
18216
11978
12814
3842
13967
19540
13008
9329
3715
16612
3125
16748
20111
16177
15312
1460
21166
7748
20194
4427
21213
18833
13370
4263
12006
10105
9690
15217
19758
6119
19233
9970
13616
6497
18655
18976
18088
8988
21122
2654
19706
18913
16495
1947
18137
16337
9202
5086
20863
20694
2850
4881
12425
836
13238
14615
19695
4811
21105
928
14327
18627
20143
8498
8965
12981
5243
10613
812
17513
19998
11137
19593
9997
15896
5340
13935
2970
19755
21048
5976
8205
15002
3094
4046
19167
11266
11020
14651
12317
12358
9619
11202
1661
5490
13618
11647
16875
1357
10437
14931
346
7444
6315
20777
20152
6811
8107
4103
6380
6712
7461
16508
1665
10794
9788
4956
16211
10435
19144
641
20788
4308
15880
20650
20016
8048
14405
4303
17900
15275
18861
6943
13718
4070
17130
989
8663
13175
19178
13429
11640
3197
6173
3676
5232
1825
7918
12644
17933
11715
1100
2762
2977
5050
2293
8269
4253
21222
12087
13659
6849
9150
5116
19523
11021
18415
17577
9548
10142
3624
4713
14765
12924
10521
2998
14644
3208
10982
16783
13404
4968
9538
3433
14291
2320
1837
11962
21188
14547
18230
17524
19655
4400
20735
3776
3152
19724
14308
11062
19771
11001
12562
11090
52
13265
8756
20709
5202
19958
11092
7855
1635
8696
12053
3823
1006
8361
9556
12514
14471
14571
10640
19460
20207
6428
12430
8389
14340
21085
2415
13780
10299
7516
7543
12587
18082
11884
747
14099
15903
18537
9927
604
16445
6707
8692
6760
20721
18246
9592
9169
13772
4653
2677
1086
6913
18506
10312
16750
7929
16901
16196
16317
19729
16469
8374
12971
15695
6886
8908
15635
18643
16553
10921
883
19817
15801
11902
19221
9316
13563
9006
20614
4076
18818
206
1151
5672
19742
16632
7585
19810
3301
18098
19152
16404
14213
2369
9890
9368
15005
2742
12011
20144
19920
18752
15282
3353
14588
5047
20256
261
504
1096
6872
20677
4113
11791
4973
9155
20063
4349
19420
4234
17809
17485
381
3008
16139
4024
20645
15214
11007
1651
514
6047
745
3281
228
14198
1922
12054
19025
6823
20011
15139
17280
7116
16478
20171
17315
5716
18898
1244
15271
4451
3099
13458
2803
12020
14801
16763
13231
21060
2115
4870
3029
3615
7757
11336
11799
17708
1747
13778
8051
13890
9833
14685
1115
9093
7435
11449
14727
6815
3162
4879
18225
19329
4538
3390
10759
16123
13761
9870
18723
3374
5006
15985
19231
14731
14711
18427
18580
8345
3244
14080
5135
20528
11457
6676
17594
12319
4415
18114
11807
15982
11228
18859
1218
10702
5507
15236
18378
16578
2286
10745
20068
3683
1564
7646
15663
16143
3918
16792
19887
7660
6695
19449
9477
10379
12063
12957
16231
11314
149
19288
39
259
9325
12268
1811
17767
16818
18079
9071
6421
9428
14036
4665
15557
7827
12348
393
12154
7178
10636
19692
11516
5283
13681
18949
12652
10831
8972
892
4794
5314
1038
12311
15623
7387
10410
9065
8042
7336
9207
10222
17445
14634
16545
2006
17742
4735
11119
18540
6302
10651
21196
15863
17770
17902
17908
6069
7908
13062
16096
5254
11269
3631
7988
11051
6431
9710
13125
14579
19484
18375
5625
14533
8760
19448
20317
20425
8053
16528
19245
486
8933
990
13151
13028
4375
4290
1504
20085
2409
8515
14089
14583
1475
1050
1277
13580
9739
1148
7673
11802
21028
18816
2154
9863
9084
18071
13386
20621
8720
3297
7894
2979
19072
9004
5843
7314
11469
12421
17149
14817
1580
18703
4027
3461
5117
2045
11814
6742
17719
8227
7328
16749
10007
4274
13106
12116
12363
4352
10820
13905
8390
3400
10106
20625
18845
14220
14490
19182
16629
16250
20608
18530
17127
922
12532
1389
20811
966
8012
3726
14072
11134
17702
1209
11692
8962
6905
765
8683
2817
1117
6435
15142
10004
15752
15476
15228
13393
15257
18904
18317
810
18295
9762
8703
8332
1521
11843
17884
941
19835
11995
8671
17976
10823
9297
7688
89
19475
608
4736
9992
12663
6766
6571
4355
14206
3645
15779
16702
366
9540
20038
2127
111
12542
8114
5356
5147
4153
9914
4391
14608
6570
17593
13704
17009
10756
16162
7843
12690
19433
18388
14357
2130
6716
19411
18069
4519
13247
17414
8799
20973
17857
7250
8085
5204
15531
10333
12848
10714
3757
17794
15789
12108
2556
17556
3498
9472
19230
1551
6974
16033
13798
13934
16160
5287
7970
15837
2195
18805
13662
6944
17613
8228
6779
1009
13183
12015
8495
3640
9783
10685
9294
6202
10239
9622
12503
20646
7709
3603
18083
4354
9749
728
4789
18163
18777
20272
15586
568
8906
12048
19305
713
3156
18795
435
2268
14135
17618
7179
11144
3916
4512
6176
19455
15464
6927
5208
8497
139
11864
769
12608
14278
3658
3828
13922
8322
213
20028
17200
5931
11451
19882
10185
3521
10129
11453
15924
15806
12270
11330
9643
11838
3331
13594
19444
9847
20662
2938
19333
20630
13560
1877
15407
12563
14079
9613
6441
10638
4178
1325
2867
12665
10895
20729
3255
10711
10899
3266
454
12431
16790
10634
5565
9569
11145
12214
18479
5125
12944
20964
13033
6483
11410
21070
13762
13615
2674
20946
13813
19717
18486
3034
16581
10590
19997
1761
8980
12055
3006
10382
9319
18214
14916
11339
15218
18099
731
6689
9835
5317
8676
20431
10064
1777
13531
4841
4805
20136
15039
5597
5534
20415
13384
6802
17790
20719
1133
12126
4010
407
10359
722
14733
16995
15248
12908
11920
20601
5573
15938
694
3443
11078
8210
1618
20570
9232
2196
11867
6865
20708
8903
16128
9390
7796
11670
17542
911
11584
6793
20786
13055
3434
17434
12269
14833
16542
15739
11601
8481
7522
7849
5859
2705
8796
2530
15310
3070
9347
20349
8504
15343
4116
16095
2528
12312
1832
2724
19440
12965
7407
13526
8226
10071
14825
6960
11655
7951
14387
12061
6386
11595
19141
3211
19469
19503
4260
19973
3759
905
11374
7833
13509
16323
4048
20532
15064
9080
13578
2226
3426
557
11461
15784
18961
20328
16197
5010
12701
14877
9445
15276
2893
7550
3415
99
9549
15572
8753
20164
9745
5532
13633
3863
2895
127
5194
10495
8786
9135
5875
8367
5699
5417
19242
319
18140
9649
3968
5964
14190
13260
8494
8298
5881
15455
13695
4680
4110
8381
8834
20774
18136
1501
19244
16488
9448
14041
1724
16378
8644
2173
3059
5399
4917
541
1940
17469
6705
21006
13035
11629
12553
15767
449
1259
12462
18827
15714
16340
6095
8024
17507
11899
5960
10470
2524
12156
19238
1326
17846
8267
12350
11529
15958
10956
4258
56
17837
18168
12860
9338
5801
639
8943
17855
9641
15232
5495
9962
12878
17134
11414
12405
17944
19840
14317
11338
12507
6362
19467
17701
11512
17066
554
17581
6931
19943
15719
18361
18012
1846
19684
826
12449
2469
4278
4806
2251
889
4800
7831
18647
4577
20357
14660
9285
2446
7592
3275
6145
6652
15939
1809
17476
6395
11399
13029
16315
7487
5345
15725
17026
21083
18135
13134
14883
16439
6446
1083
8687
20128
8271
3316
18346
17336
54
12792
12728
601
175
5685
778
19404
17835
2722
2278
20424
21211
19001
2306
18147
16349
13122
2142
7219
21171
1775
2693
4443
2733
18460
2628
19600
5187
8011
17665
12791
4093
15590
7782
16272
17824
6578
13250
18839
7598
15154
14988
2670
15073
13153
2673
7765
27
2295
1114
10394
4173
9977
11441
14741
3949
11520
11219
18800
11731
12286
3335
6270
14759
11220
4916
12393
386
17776
16427
20381
15773
4990
7811
1497
19690
14981
11130
20182
18880
3795
4460
19268
15821
11658
16261
4309
15934
19859
11830
955
13367
18586
697
5518
15583
4280
14221
16762
11296
11861
1844
7041
3573
3590
2889
5657
18264
12075
18583
94
5632
8831
18788
11870
16099
15716
19913
1887
8650
11943
8983
5228
19723
13972
7830
9457
18754
12641
12527
2597
7689
3801
7864
1186
19059
17124
11940
9953
17898
4181
12937
1669
18993
14084
7535
9030
19232
2356
4715
7366
7367
1082
16185
12658
10273
9203
7302
1280
6021
11669
12726
10040
3384
4559
8301
16373
1205
1620
1423
4820
15984
4041
3837
14174
865
17966
16213
7229
8598
5422
11473
17369
2511
10345
20769
4357
18018
12066
10515
6004
11708
17352
10206
16193
1387
2062
20049
14739
18922
15285
20240
20910
15364
15199
9946
12718
14876
13849
16649
13316
18794
13562
12735
7538
17730
7237
13794
15962
12433
4329
4518
15192
157
5730
9495
10342
3153
7443
15676
1520
2723
7410
3405
17424
12602
642
13376
16757
2616
5904
7652
8565
12646
14577
7264
8134
13952
3140
1786
19438
7114
18220
8712
19018
19568
14552
1615
10796
13318
5474
9980
13545
9192
15693
14082
598
14511
20495
10859
2844
10960
19186
10534
14029
19115
15710
2153
15379
1241
16735
17374
6106
15879
18979
145
8260
5862
5324
2302
1690
3531
18178
5186
195
6406
9147
20157
19870
7298
17999
15811
2560
10809
20339
12388
14641
16704
14071
17540
10821
15771
16420
1302
6233
15605
18122
6547
8520
6228
3496
4235
405
13814
16270
19516
6890
2825
9578
16090
1002
6246
11760
3240
18242
12828
14074
9055
17079
4177
11720
17943
20218
6150
14121
7754
1664
4002
71
17355
12404
2545
10074
794
6010
1421
2080
21133
12629
2960
10668
2331
2648
821
3710
9296
13412
1227
20517
3095
10655
1154
10558
16698
18564
3537
14379
18259
13709
18930
13646
15802
6750
5766
8791
2595
20165
21197
20293
7417
8969
1074
10540
3215
2493
1225
7025
20919
11561
19885
12016
15022
16204
4701
19634
6553
20942
11949
1172
14857
18713
17969
10510
10932
14729
19000
16693
12419
15092
11891
16236
10998
4625
16941
16886
2790
3607
14388
15869
14692
5750
11102
13987
12875
4064
12273
10880
18522
15857
15653
20695
9509
15381
19147
15189
10682
15861
14958
17539
7678
467
18254
5288
20911
13127
135
3601
18532
7258
3674
2134
4849
9468
16156
16669
17139
16921
2229
17181
16014
17410
10852
20253
11162
19060
4536
13927
860
2787
20385
3665
13381
13645
4549
8564
2707
12490
8606
20147
1081
2308
16307
10856
6432
10278
9758
16747
21186
15307
11913
8234
11984
9385
7304
4085
9791
9897
7986
15895
5748
13497
13963
11156
21037
14344
205
10307
725
19601
13846
8635
3556
5246
2792
20857
12880
13264
8643
8978
20023
18888
15035
10096
6257
14774
5080
565
8665
104
8781
3246
8399
17400
14011
9790
3604
12284
16266
11747
3899
15966
5141
820
4986
3072
17203
8858
10818
5341
7315
19153
13320
15149
16352
21174
7555
12765
5957
14497
14609
9241
12446
8187
6936
14814
15272
10966
20599
20327
864
15496
478
4896
9566
7386
475
20295
19989
16549
4186
12988
15505
12815
4978
18747
15120
15835
179
8704
9035
13715
10360
11801
19925
8735
13192
15346
8350
18918
13294
17822
7046
107
16616
4857
13970
3891
888
12683
10289
17053
7373
13423
16287
9040
18291
8977
20212
7890
15441
18504
4136
12090
8882
15917
1823
6307
3349
7286
4671
9130
9377
344
10611
9820
1499
5375
1667
1203
7021
14763
18167
8869
2022
17829
1774
19299
18947
5081
11998
15016
11164
19255
2676
2452
8522
770
7119
9960
19493
13230
10934
11348
11651
11563
172
17658
17042
981
20370
19796
17165
20682
2221
5693
16582
1273
1872
6654
14911
6787
4821
5719
18688
6573
6083
1183
5410
4038
19804
2544
20281
1222
3725
15266
13559
12818
11229
4276
9489
12456
5621
16791
7846
1700
19862
3170
3488
5578
14106
7783
16359
1226
4763
3163
19981
14161
1589
12614
14900
3091
5525
1882
7914
10950
19661
12301
1950
932
8697
16460
17603
4058
12402
13001
4998
3599
16499
18058
19797
3789
14086
5151
14920
18256
19546
19410
17517
1518
16758
11402
7134
12390
6188
19207
2925
17766
11929
13083
4497
6065
4697
15311
13630
16208
16135
12224
2521
1772
9636
14993
20892
16576
17191
114
12397
9687
6198
16668
3483
8545
8008
12645
13884
17174
4635
12194
9573
4344
4133
5795
1400
742
10157
16910
14832
12285
2103
1614
18685
21032
1026
9796
5559
12675
14897
13432
17421
15960
3802
707
6442
18650
13722
19057
4551
18040
11316
19645
5472
16031
8376
284
9455
15219
10305
5063
2098
8961
9470
12777
6454
19511
2138
13475
3464
14945
2263
851
20096
4527
5313
20738
9049
20548
10801
21147
8970
11070
5062
1821
1796
19321
6400
3883
18081
16006
12929
5209
5983
7617
5921
4599
11823
17875
7874
11151
1641
17795
15957
8262
19422
13611
350
12879
12512
14168
19579
1315
3934
764
9904
3882
9388
5461
20276
2351
1393
15412
2697
3770
7097
5064
15499
19205
8512
13836
19028
14611
15490
6058
4161
1283
8182
4987
10460
11604
7958
9274
8525
5681
18792
10139
4964
4636
924
3854
10196
4946
8192
8119
15741
12391
1634
1351
9801
2215
16809
7222
3670
8909
801
13197
8121
4852
17903
18001
7204
1206
8780
7609
21072
263
6464
6220
6567
11283
14299
2491
3225
2390
7865
11871
3113
17016
3074
17351
15533
13585
21159
18031
14826
13133
13939
18193
3557
17260
19149
3237
20139
7110
19659
1892
8065
19580
20056
18231
11074
18550
20913
9867
7059
14402
7807
13100
14653
19892
8896
11906
6621
19873
5244
16325
7210
17839
8699
7234
12206
2843
17082
4405
9219
18750
13701
13241
12321
12216
7558
3743
1867
15959
17431
15722
6208
12633
746
2373
3467
15049
4322
14489
4910
10924
7331
754
13289
18419
13307
9299
835
8022
2744
4371
6591
216
13295
10166
8318
18418
3104
2527
2884
4619
2272
14967
11147
2218
191
13820
21061
13581
4242
16397
226
161
14802
12400
1763
8422
15847
14075
10667
17447
12088
7163
14990
16583
7445
3124
7425
2467
16998
15056
16761
16136
14024
5456
20042
8101
6332
18870
7923
6125
10566
2534
20686
11465
3151
21000
852
17639
1324
6743
3941
5073
5447
13334
20585
9617
3396
6455
1870
18897
14865
9191
15772
4687
8611
13527
11037
16724
4696
12481
19095
11926
20948
19521
2875
6771
16690
18927
10340
33
5106
14097
12925
18760
12439
9116
1695
14800
11113
15479
20773
16589
11120
18115
7566
12149
10918
9898
16487
21088
20125
6266
20051
8245
14155
14184
18546
17244
20642
8235
7091
15948
6113
13044
9002
13716
20029
7738
1374
2146
14356
3146
6076
1730
17056
13107
19361
8623
9359
14543
4227
2468
1355
20864
6875
8486
3190
547
21020
16765
18527
8490
19345
8728
17342
15112
7618
3727
795
17261
7777
18164
15768
5876
8668
3942
7520
17734
8939
11836
8069
20149
7037
9100
8931
3407
19501
18601
1138
20981
8851
528
1577
19663
18903
19430
9321
4567
15723
8807
4332
12889
9995
13202
19308
4610
9379
399
18207
3509
9528
4951
10964
5289
8159
15425
10331
19437
9106
4
13032
6557
9786
2917
4337
6288
9206
7922
19300
8212
20801
3051
2458
15144
11423
1144
4828
227
2581
251
3066
855
2339
10020
17307
9372
3096
5248
16621
6819
19118
1468
8089
15488
1899
6342
8328
16421
2018
14389
10151
5873
4904
5297
2190
11525
1954
4514
7374
15931
14381
313
4802
11104
1666
12300
16117
12554
17906
13410
70
15703
8947
614
2496
19693
12790
10726
8308
10094
2596
8737
10734
8438
1359
17737
19271
12669
5732
9132
16756
1341
5110
12639
11776
12543
17088
10110
2005
20013
13748
12891
7084
19848
3529
9138
704
2907
16502
11364
18491
20526
12067
2833
15617
18192
15554
19319
167
14823
6451
753
18396
7355
8527
13331
11901
21109
8096
566
6146
16517
14263
13251
2353
5235
6782
935
17368
2303
14067
9430
8312
11615
14561
13024
16411
17167
18696
6374
1507
14663
797
3089
275
16657
10876
1744
13047
7200
21134
14167
15987
11238
10688
12952
21191
5686
8359
15336
6354
6532
10287
7572
4521
5831
9877
10728
18678
20287
2166
11649
9264
16433
20933
21179
19086
18075
12977
6241
20853
20022
12670
20576
4135
11976
5079
11535
8894
17762
9871
12802
5999
20980
2255
3800
6683
3779
21017
1979
2506
9760
2740
19743
17180
6158
13901
1779
4283
7001
17661
20754
17739
8997
6261
5977
9198
18338
11925
10154
3358
20344
18431
18440
17071
5552
18464
131
16516
6064
6259
16787
6082
6368
18321
14256
11497
8963
18074
17670
4433
2394
8783
3637
14194
3761
7036
14151
11820
17371
3330
2204
1879
7485
3233
19031
16666
4446
2739
16443
3628
1548
515
6014
5066
10812
2382
8155
20430
7530
20610
10371
105
4694
19680
18383
3346
11307
13754
1471
10862
6904
6194
14927
4501
16930
10084
6118
18531
9494
12857
16265
20974
17397
1125
19791
3925
10227
644
6797
337
18281
13282
10784
12886
7353
15926
20075
14899
8457
21148
18497
16726
4165
19396
18841
9821
17107
6267
20889
15792
13730
19605
13739
14809
3293
11243
8499
3040
469
13454
15621
16630
13364
14554
12338
1652
9956
1888
10232
20434
18844
19822
9484
11957
7284
5807
9400
12022
19063
16269
5184
7220
6155
7645
19906
7466
12109
19428
1477
8886
3106
17426
618
10245
7594
8992
20766
14386
727
6489
14423
14578
2002
6450
8100
11097
1256
9474
12201
20367
7260
328
7753
20512
11127
6545
20655
17163
7819
17038
10176
14124
15204
3681
20486
14015
11210
6664
6638
5402
1486
5123
17819
6503
9237
5210
18745
9413
18123
19009
20210
20506
8758
8166
16442
11983
6420
729
3750
18796
19106
5994
8798
4705
9168
10169
15564
387
6955
10505
18336
1381
7957
4039
383
18889
5290
4005
351
6218
13054
15255
20197
14043
3254
21149
13832
5370
8329
4825
12247
18883
15420
11762
6917
3903
3175
1746
9078
13276
2423
6392
12212
10448
12235
12432
20043
15911
14260
11227
20455
7720
18095
2944
10687
7614
6998
8293
20228
15303
8310
8323
14017
1851
16548
6469
17147
4373
8784
19787
6517
14616
20720
14073
3364
3393
7729
18671
665
17073
7029
19854
10101
15800
9991
2020
19660
10892
20791
10439
6370
12719
211
3317
15790
9759
19177
15853
20140
13421
9823
20718
733
2265
1609
11258
8914
14886
12271
4516
20320
2879
13222
11064
11706
11585
16779
3432
1175
5530
9542
14105
14311
6928
12428
653
7877
18549
9200
7108
12229
7503
13052
3995
6232
10475
16296
15459
7480
20232
11049
16114
5336
11528
20990
14335
11044
3694
4884
10780
17573
13011
9073
5386
4468
10187
13880
2777
13660
20698
7285
1333
6637
11835
1238
16000
18579
6518
18035
18465
5814
6281
5501
20490
3836
12793
16430
587
655
21111
3956
12038
630
6900
14852
18245
14297
9352
17195
8519
8062
1728
12549
14111
9541
5514
13290
4738
13872
1463
2737
19954
1461
9869
4351
8990
18302
656
16785
13252
19217
658
20551
13337
20563
1127
16896
12365
142
4115
17979
17318
11259
12694
11745
15006
20443
1783
375
14406
18416
11480
20536
9246
20142
18402
16191
540
15245
12689
8825
6215
6430
355
5803
20361
7624
388
2542
3021
6359
10917
12949
9038
11502
21087
15829
15581
17873
15992
1156
19363
4915
12575
19953
8708
16146
1164
14139
4033
13637
15659
18963
11575
19698
4341
18557
2719
4611
20196
13240
5451
12945
14267
735
17356
7075
8543
5310
15314
16048
638
10776
7792
10443
20394
7107
19246
14426
16700
12371
9633
16835
14473
14276
8562
5070
2420
6251
7608
7238
19236
13215
20334
8300
8136
18420
6693
11294
3065
19125
1792
8236
20004
10058
2407
21169
6660
17278
16736
548
7402
16292
17538
867
4299
2004
5349
18392
9615
12198
13691
13893
1936
8439
7066
18390
20908
19265
7712
16695
18229
17604
6726
6678
5109
6696
14549
6472
10519
18188
1487
7422
21102
5684
11627
11234
2299
8401
3077
10033
14754
16251
12862
8117
803
8102
5742
22
17106
10484
4958
1928
10984
15299
2029
16918
9972
17169
8482
2829
7527
13103
1234
11950
16619
8667
3634
4105
17321
17862
7817
18062
9016
10202
20260
1296
19949
1575
5764
10067
8845
6558
17995
10172
18258
9803
13037
3765
13764
11907
12231
12027
15522
18843
19338
16482
17625
18951
5465
6690
12528
9777
6415
19032
15046
9971
18352
7055
17774
339
6020
916
752
10321
564
10006
19343
9663
16996
2501
11129
20000
7972
17780
2669
12510
1441
19267
4345
2137
1638
2783
9753
11590
18162
11523
17299
15548
17133
5673
917
14042
1787
5247
18895
5765
10056
18611
16926
18441
4199
13225
9735
3242
8339
18181
10311
1929
6881
12720
3623
3064
16562
14003
5993
7054
10849
12556
4759
12434
5074
3247
2942
11753
12274
15770
645
15701
3298
7341
17676
17668
7266
18500
10543
16333
6813
15247
428
7883
13508
5284
20657
370
15954
14885
530
563
7732
8335
6544
17329
668
8700
16240
13944
20371
18408
16804
15834
13072
10171
1624
1314
12021
21026
15803
18046
4542
18944
6616
349
10885
9223
5352
12973
16917
12585
1975
20159
3707
13070
20762
11226
3280
14445
4920
6627
18421
4650
21058
10344
9594
4831
15156
11868
12136
10402
12341
3325
2156
189
17179
20632
18907
4552
8850
9189
340
11758
7559
3261
19492
18299
3207
14076
17396
11521
20663
20407
7126
5303
3618
18892
6899
10208
1221
551
9415
2623
17037
19606
16403
4498
7540
16245
20481
17358
1248
5275
15175
5459
2918
12189
15062
1131
10968
2612
4865
1185
14751
16909
4082
10195
12236
201
19611
16161
10723
9317
10277
4040
19884
1399
13498
7604
13881
17018
14699
19010
17877
1875
15044
14354
20825
20914
11959
3764
19666
7089
359
9558
2815
856
5886
18244
19318
13747
16091
8600
5542
9648
1290
6918
19364
9397
14597
20432
21192
12573
19505
15894
15904
101
21104
13777
8870
16837
13463
14007
18052
3035
6411
18017
20567
10367
20104
3090
3053
15634
242
13452
5034
14730
11408
4782
7109
8060
10021
19947
5476
21143
7714
6965
736
19764
9681
16013
12491
4955
7946
17157
4620
14776
12803
19058
15631
6275
40
14964
14603
10209
8566
9986
19044
5825
1265
14813
20987
5416
1484
12346
673
12498
13126
3739
4962
5915
18664
11293
18698
17069
13450
13840
12810
902
13949
8049
20543
12447
13962
1427
5326
12483
1429
5773
8658
1370
8003
20905
8899
85
14955
17844
11805
9363
10162
2112
7275
8450
2590
13352
7948
13485
10911
16216
16734
789
2133
14275
9502
8741
3696
5196
20748
7564
10502
13793
9313
13827
5570
4898
919
19273
9018
15442
3230
13732
5182
16563
8629
7836
7291
14188
21064
849
4484
21185
15337
3078
4367
15008
10153
5128
10875
17375
5419
17868
7325
1579
19519
16448
11321
9137
6510
7815
11375
8198
18680
10168
4051
7381
4401
15099
19911
20395
7960
13515
18161
15819
6945
5758
2505
2178
4762
17895
10375
10568
5178
6413
15327
18209
4286
5358
17968
2870
11035
4431
13408
20638
6391
14639
9587
3493
10319
5429
8508
5580
12713
8109
7517
21021
674
20457
1757
8139
6508
12143
6537
5650
15943
11844
2831
16360
15169
8063
13809
8966
20510
8327
3902
1799
3102
20606
5794
9394
4159
16511
14710
14154
8855
7653
7582
5914
13617
18273
13555
1412
14972
5398
20498
7774
19993
5321
20807
3196
5159
6108
12809
19990
3664
18217
15905
15253
18021
13628
19986
13233
471
15115
7357
17498
9520
1778
13974
11955
18
1921
4991
5039
10781
18287
17335
16774
5988
17852
3571
6617
385
2594
7900
13113
1862
4335
2842
20658
10350
8729
2484
3502
6867
18240
1034
9964
18170
18681
13818
13977
21029
18105
10286
17273
11897
5355
16319
144
14928
1403
9320
1349
14382
20345
1334
13885
10514
12678
14411
6924
6784
5727
9973
19945
3931
4170
21175
3039
2216
13111
3361
7457
15907
19098
8398
492
19462
18061
3506
7536
15818
10034
16221
19050
9797
17558
17942
4268
8878
5464
18667
377
9526
7303
17977
4823
8622
20025
995
19621
15787
18182
18960
3671
7717
4222
8480
276
8561
16838
5963
18972
20598
12536
3944
6424
3413
3058
10785
7505
5645
3054
9194
10102
19463
9366
12730
7242
9059
576
14116
7071
1350
13613
324
7006
11349
16963
2287
12205
12845
13567
1924
9197
8207
8871
3378
6926
1458
20838
19701
12732
1704
9899
8436
4397
552
2784
18224
13911
9245
12248
5689
10652
20409
5637
11175
15357
14602
20637
7187
5544
18151
13456
6934
11279
12342
8655
6759
6885
11850
8326
7898
14682
3404
2706
15643
20534
20676
10414
7470
11797
14982
4359
7589
13207
1593
8645
20473
19495
4031
13892
16249
20574
1231
3451
9464
19280
15750
18694
16303
384
13583
8018
4297
8259
10725
16361
5144
13874
11481
21217
16741
6296
12395
4162
20553
19380
4839
12921
1449
5692
17881
17054
2488
18261
846
6580
8898
7655
15360
2474
6027
8599
14457
11002
20934
20297
9868
11587
2205
14458
16462
15250
5709
17012
18296
14863
20041
13486
16903
9284
20781
4262
2476
12290
19176
7872
2371
10009
4018
86
20925
9440
12668
14347
15906
20280
3438
918
15826
3585
9798
5725
17584
11008
21218
7562
6948
4993
7730
8782
15494
17419
14509
5134
13234
3755
7880
16856
13995
817
14117
14337
4147
15150
16484
14881
1672
7838
21114
8184
15685
17526
15440
3766
4448
10708
555
7856
18912
10913
15589
10739
14687
11683
10308
15113
210
3334
11672
6855
10715
19809
20772
16891
14418
16525
20988
3554
631
19143
9934
307
13071
5307
19325
20702
7352
17954
1267
18311
14186
16994
703
13900
483
2290
20089
10737
18842
215
4377
4154
1903
3998
19045
15378
15368
20880
20545
9188
17948
17482
7606
2599
4326
18855
10795
2030
11513
3636
18502
8357
12461
14453
10988
13074
16836
14342
10314
3347
20335
11855
6409
15013
8955
16039
15809
20289
20491
19633
14539
15444
17962
8185
11045
10680
13894
14235
16564
8837
21119
686
5615
5738
8449
9822
6952
17952
8463
10909
3075
5609
3698
12986
15162
8264
6942
7534
9814
16641
1192
5265
12322
17941
10031
1805
9842
11286
7416
1473
17617
21099
9282
7808
10981
12767
3551
6324
7045
3685
6847
15143
4930
8666
9691
20117
9304
5033
11923
17232
5431
8827
19555
1301
6861
2583
18154
15000
561
6989
14026
2793
18832
11953
2478
16097
4628
338
12296
16627
15107
20712
5118
4565
3180
6097
16780
7471
20993
2412
1320
5735
4676
19314
19718
12293
10527
13447
7871
10282
13917
11569
11272
6933
16711
18043
5947
6159
5596
1662
12113
17239
14628
9011
4608
15361
5867
18761
1994
8265
5869
9978
1140
19395
12367
1165
12407
14333
16798
7625
13446
1289
16244
14160
18821
20386
20008
17293
5554
1095
20504
11539
2327
14613
5387
2341
2040
6141
15024
842
4827
10804
5817
19069
7185
8434
5752
10348
13212
6862
19518
11987
7680
9216
20852
18936
5230
4479
17214
9838
16770
13227
15539
2627
1122
20835
16409
37
5030
9586
20775
10735
12685
908
20399
3688
17394
10353
21116
10731
12132
11087
13766
14364
8594
10001
294
13237
10471
13812
12895
10709
2176
17376
14339
7295
4053
13796
808
2904
8754
3406
2769
12460
16990
11809
13253
19510
5455
759
8849
20034
1141
1066
11152
334
3648
66
17865
16544
10220
18435
17052
18751
13169
2901
9938
4102
3270
9103
13312
18935
6154
4148
16676
2472
9702
11711
8362
10802
12208
7524
15419
5855
4384
550
9640
1927
18654
19349
11267
1153
1446
9711
5148
16334
7947
2024
18116
12854
16382
1017
534
19490
7893
4006
367
20943
6404
14598
2388
20820
5937
15970
1678
18809
6509
2017
5723
12265
11125
5240
20873
17382
12598
1121
2061
7926
6506
3013
20389
16279
18606
6100
11466
18189
17590
9222
409
10335
14573
2509
10743
9213
21162
3994
675
17726
6175
13118
8627
10978
5922
17212
15129
17282
15972
4587
2653
14550
2809
14439
20084
3972
2708
1190
2271
18169
3984
5174
19891
9424
4647
21076
4675
3542
1338
5212
11429
10391
9365
10542
4775
19254
16989
577
9044
18735
12340
14108
15472
2060
4761
7023
14443
20944
16290
7385
21073
12684
6515
20087
10942
4358
3392
3428
6864
9026
13461
6796
7699
16557
14926
9131
837
6206
1967
6795
6783
5351
13017
3329
13209
10409
1300
87
20377
19700
13676
2056
12174
17548
6788
12637
14217
3932
4348
7138
6179
972
10045
14559
4187
90
4950
17451
389
13797
4129
6589
8556
2000
13908
20904
19940
12078
5019
20597
2785
12852
5590
19372
14905
6605
151
10614
19722
1137
19435
8454
5376
16134
15613
8603
12259
11608
11763
20471
13042
20133
6731
20631
14891
17343
8282
48
2622
2421
202
418
20810
12900
12453
16592
14932
19922
2865
2475
15654
8066
11905
11573
217
11462
3990
11676
6935
10238
5199
4068
7698
6527
10164
2562
6579
21033
7939
18668
11427
20438
18933
9813
2994
9714
16280
18366
16954
2806
8677
3741
13622
10889
798
8589
9493
17918
8380
761
901
16932
12820
660
18565
881
8045
7676
21054
6536
4424
15665
1291
19777
10732
14849
6323
10700
19442
9773
14892
5180
19748
16365
17728
13216
15766
5037
17511
17340
1698
4486
7568
5433
11392
13891
16209
18176
14786
19471
8431
5130
7998
15544
1943
18539
67
13112
16187
14178
17300
20461
14500
758
15448
20185
18573
16599
11315
17117
18749
10458
11619
3314
831
13213
7099
12771
11510
9926
21123
7223
2307
9564
7546
6355
7016
5055
4895
13357
2610
11223
3172
14697
20571
20778
20493
9544
9671
5569
12051
6328
1720
2968
17672
18615
3369
315
12656
246
1574
2050
3527
11739
7719
14173
16252
6358
6490
19751
15399
16170
19002
6295
13226
8656
12225
6800
3276
7619
21079
8802
12032
20474
1537
13752
2838
3848
5282
11440
17201
8007
3311
21036
975
17696
19137
10843
6629
8865
6031
7390
11597
16729
12548
7209
18831
1795
14563
19820
792
2549
5124
17450
13656
16667
17845
15201
606
1797
15664
12074
3149
20578
9672
1211
17566
1413
14678
1588
9212
16823
15721
16766
11362
3055
14819
17367
8901
16602
3818
11618
11526
11550
18697
1150
11956
20845
17172
9048
20467
20960
13137
2766
11916
4179
6982
7233
17669
10108
16573
18472
19096
7474
17901
18478
1926
20885
4461
9738
1298
9331
5473
15530
5088
7324
20065
11048
18533
945
1282
18145
3241
5087
11829
13505
18078
3417
5606
9794
9384
17112
7919
15392
14189
20184
15185
14210
13292
14655
11131
2684
7746
6962
14028
12153
7103
19038
92
6289
11297
6311
600
18556
8879
11095
8559
21095
2259
8451
20337
7775
543
9356
5334
8161
1490
16380
20888
8774
3030
3103
8890
6438
15223
9324
18644
5824
4232
14150
12580
12600
19533
9288
10436
874
9090
8493
8372
1243
12567
9539
2602
20671
9682
4885
14040
11280
19575
2386
6912
20558
652
19711
20214
15780
4233
12763
9756
2301
18468
2589
10097
14131
8864
9287
12457
8953
13605
6727
20896
9618
15328
1136
18417
2846
11681
19704
17373
19145
5804
17889
17746
3606
10066
10916
5968
9431
20533
14438
5347
18877
12040
17840
11970
12672
6053
5608
19799
7297
8695
17277
1540
13401
7537
14482
16437
15536
7011
3477
10434
13178
1179
11201
17946
20153
15743
5535
15998
14159
10423
5449
2794
5392
13683
17236
5044
4596
3401
9929
7375
9965
4612
1339
14241
14725
15450
11817
3975
424
18939
9924
348
19405
1382
9114
12409
5286
20458
20771
5421
7514
9289
18676
12095
20188
19088
13807
19136
1018
3584
10380
8082
4977
11282
12277
14665
7052
3639
14861
20538
12966
10629
20844
20784
4023
9944
20530
20392
8593
7263
12398
1912
14103
10766
14269
1235
17288
7327
17757
10128
9658
2780
10721
18023
7321
8555
7602
460
7393
15203
2429
12188
7560
3159
9491
5746
14176
8722
2919
18608
10499
15858
18404
7711
279
17462
34
16465
13621
15241
4914
8369
14619
8577
15763
1808
15229
7256
15830
5726
20447
20003
8232
724
10433
10119
12741
12704
3117
6476
9025
14510
1923
2845
2033
1217
14898
15146
4327
1331
19849
10581
15434
16813
5274
5978
358
19926
985
15842
2502
14787
3245
11237
7734
3561
4458
15351
9057
4966
16370
15057
491
13099
19839
10509
6169
815
7496
988
341
5167
5700
9459
18899
13768
12288
16451
9858
18476
5251
6577
20405
1599
5059
